console.log('JavaScript')//пропис за яким інформація показується у консолі розробника
console.error('JavaScript')//пропис у консолі розробника яка показує помилку 
console.warn('JavaScript')//пропис у консолі розробника яка звертає увагу до інформаційного повідомлення/попередження
console.info('JavaScript')//те ж саме що і console.log

//Прості типи даних для змінних 

var /*або let*/num; //змінна ,цю змінну можна змінювати на іншу(знизу прописавши їй інше значення)
num=5
console.log('result:'+num+'!')//можна показувати одразу кылька значень

const number=10 //змінна, значення якої неможливо змінити , при прописанні іншого значення код буде видавати помилку
console.log(number)

var num=5;//тип даних числа (number)
var name='Ivan';//тип даних текст (string)
console.log(num+','+name) //перекреслене значення означає що воно застарівше



